# Import All Library Needed

In [1]:
import pandas as pd
from pandasql import sqldf
from sqlalchemy import create_engine

# Configure Database Connection

In [2]:
# Konfigurasi database
db_uri = 'postgresql+psycopg2://postgres:12345@localhost:5432/de_mentor'
#f'postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}'

# Buat engine SQLAlchemy
engine = create_engine(db_uri)

# Do aggregate data From table and save to variable

In [7]:
df_aggregate = pd.read_sql(
    '''
    select 
    gtz."RatecodeID",
    case 
    	when gtz."RatecodeID" = 1 then 'Standard Rate'
    	when gtz."RatecodeID" = 2 then 'JFK'
        when gtz."RatecodeID" = 3 then 'Newark'
        when gtz."RatecodeID" = 4 then 'Nassau or Westchester'
        when gtz."RatecodeID" = 5 then 'Negotiated fare'
        when gtz."RatecodeID" = 6 then 'Group ride' 
    end as rate_code_name,
    count(gtz.passenger_count)passenger_count,
    sum(gtz.total_amount)sum_total_amount
    from green_tripdata_zone_lookup_vendor1 gtz 
    group by gtz."RatecodeID"
    order by gtz."RatecodeID"
    '''
,engine)
df_aggregate

   RatecodeID         rate_code_name  passenger_count  sum_total_amount
0         1.0          Standard Rate            24184         326462.32
1         2.0                    JFK               23           1329.06
2         3.0                 Newark                7            358.36
3         4.0  Nassau or Westchester               12            662.24
4         5.0        Negotiated fare              980           9285.98

In [6]:
test_ombak = pd.read_sql(
'''
select * from green_tripdata_zone_lookup_vendor1 gtz
where gtz."RatecodeID" = 6
'''
,engine)
test_ombak

Empty DataFrame
Columns: [VendorID, lpep_pickup_datetime, lpep_dropoff_datetime, RatecodeID, PULocationID, DOLocationID, passenger_count, trip_distance, total_amount, payment_type, trip_type, Borough, Zone, service_zone]
Index: []

In [9]:
#jumlah record yang akan di save ke table
count_data = df_aggregate.shape[0]

# Load to New Table in Postgres
TABLE_NAME ='aggregate_green_tripdata_zone_lookup_vendor1'
df_aggregate.to_sql(TABLE_NAME,engine,index=False)
print(f'Total Record has been inserted are {count_data} to table {TABLE_NAME} ')

Total Record has been inserted are 5 to table aggregate_green_tripdata_zone_lookup_vendor1